// --------------------------------------------------------------------------
// 📌 [함수형 프로그래밍 개념 학습]
// --------------------------------------------------------------------------
// - 순수 함수 (pure function)
//
// - 순수 함수 작성 규칙
//   - 입력 매개변수를 가져야 합니다. 
//   - 상태 값을 가져서는 안됩니다.
//   - 입력에 의존한 결과만 반환해야 합니다.
//   - 외부의 것을 변경해서는 안됩니다.
//
// - 순수 함수를 사용하는 이유
//   - 재사용(reusable)
//   - 구성 가능(composable)
//   - 손쉬운 테스트(easy to test)
//   - 캐시 용이(easy to cache)
//
// - 순수 함수 작성은 쉽지 않지만, 그래서 좋습니다.
//   - 제약이 따르면 관리하기가 쉽습니다.
//   - 함수형 프로그래밍은 상태를 최소화 하고, 상태를 엄격히 관리하는 것입니다.
// 
// --------------------------------------------------------------------------

// 순수 함수 예시

const add = (x, y) => x + y;


// 불순 함수 예시

const minus = (x, y) => {
  console.log(x, y); // impure
  return x - y;
}

const sum = (...args) => {
  fetch('https://jsonplaceholder.typicode.com/posts')
    .then(res => res.json())
    .then(data => console.log(data))
    .catch(error => console.error(error));
  return args.reduce((acc, cur) => acc + cur, 0);
}

